---
kind: type
id: T:Autodesk.Revit.DB.Events.PostDocEventArgs
source: html/a9b656a0-233e-4204-9013-02aa12666814.htm
---
# Autodesk.Revit.DB.Events.PostDocEventArgs

The class is used as base class for arguments of any post-event that is associated to a particular Document.

## Syntax (C#)
```csharp
public class PostDocEventArgs : PostEventArgs
```